#include "radarsensor.h"

unsigned char GetCrcPackage(unsigned char B, unsigned char C){
static unsigned char cbit[256] = {
0,1,1,2,1,2,2,3,1,2,2,3,2,3,3,4,1,2,2,3,2,3,3,4,2,3,3,4,3,4,4,5,
1,2,2,3,2,3,3,4,2,3,3,4,3,4,4,5,2,3,3,4,3,4,4,5,3,4,4,5,4,5,5,6,
1,2,2,3,2,3,3,4,2,3,3,4,3,4,4,5,2,3,3,4,3,4,4,5,3,4,4,5,4,5,5,6,
2,3,3,4,3,4,4,5,3,4,4,5,4,5,5,6,3,4,4,5,4,5,5,6,4,5,5,6,5,6,6,7,
1,2,2,3,2,3,3,4,2,3,3,4,3,4,4,5,2,3,3,4,3,4,4,5,3,4,4,5,4,5,5,6,
2,3,3,4,3,4,4,5,3,4,4,5,4,5,5,6,3,4,4,5,4,5,5,6,4,5,5,6,5,6,6,7,
2,3,3,4,3,4,4,5,3,4,4,5,4,5,5,6,3,4,4,5,4,5,5,6,4,5,5,6,5,6,6,7,
3,4,4,5,4,5,5,6,4,5,5,6,5,6,6,7,4,5,5,6,5,6,6,7,5,6,6,7,6,7,7,8,};
return (cbit[B]+cbit[C])&0x07;}

//
//buf 为一个数据包指针，依次存放A，B，C 三个字节
//返回距离值，校验不对返回-1
//
int DecodeLaseData3Byte(unsigned char *buf)
{
int distance;
unsigned char crcdata = GetCrcPackage(buf[1],buf[2]);
unsigned char orgcrc = (buf[0]>>4)&0x07;
if( crcdata!= orgcrc)
return -1;
//计算距离,A0,B6..B0,C6...C0
distance = ((buf[0]&0x1)<<14)+((buf[1]&0x7F)<<7)+((buf[2]&0x7F));
return distance ;
}